app/controllers/products_controller.rb

INSERT INTO `products` (`name`, `precio`, `descripcion`, `category_id`, `cover_file_name`, `cover_content_type`, `cover_file_size`, `cover_updated_at`, `created_at`, `updated_at`) VALUES ('h', 7, '', 1, 'pk.jpg', 'image/jpeg', 131125, '2016-10-01 20:11:41', '2016-10-01 20:11:42', '2016-10-01 20:11:42')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `name` = 'h', `stock` = 1, `descripcion` = 'g', `updated_at` = '2016-10-01 20:08:42' WHERE `products`.`id` = 4
---
  def update
    respond_to do |format|
      if @product.update(product_params)