app/controllers/reservations_controller.rb

SELECT `reservations`.* FROM `reservations`
---
  def index
    @reservations = Reservation.all

INSERT INTO `reservations` (`descripcion`, `nombre`, `apellido`, `email`, `telefono`, `sexo`, `fecha`, `created_at`, `updated_at`) VALUES ('asd', 'manu', 'baca', 'asd', 12, 0, '2016-09-28', '2016-09-28 16:15:55', '2016-09-28 16:15:55')
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save

UPDATE `reservations` SET `nombre` = 'aquiles123123', `apellido` = 'baeza123', `telefono` = 123, `updated_at` = '2016-09-28 16:16:59' WHERE `reservations`.`id` = 3
---
  def update
    respond_to do |format|
      if @reservation.update(reservation_params)

DELETE FROM `reservations` WHERE `reservations`.`id` = 1
---
  def destroy
    @reservation.destroy

SELECT  `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 3 LIMIT 1
---
    def set_reservation
      @reservation = Reservation.find(params[:id])