app/controllers/services_controller.rb

SELECT `services`.* FROM `services`
---
  def index
    @services = Service.all

INSERT INTO `services` (`tipo`, `precio`, `descripcion`, `created_at`, `updated_at`) VALUES ('', -6, '', '2016-10-01 20:37:44', '2016-10-01 20:37:44')
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save

DELETE FROM `services` WHERE `services`.`id` = 1
---
  def destroy
    @service.destroy

SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
    def set_service
      @service = Service.find(params[:id])