app/views/products/_form.html.erb

SELECT `categories`.* FROM `categories`
---
    <%= f.label :category_id, "Categoria" %><br>
    <%= collection_select( :product, :category_id, Category.all, :id, :descripcion, { :multiple => false }, { :class => "my-custom-class"}) %>